Repository: weblate/jamuluswebsite
Catalog: _translator-files/po/*/Software-Manual.po
Languages: th

source: en
th: th

source: User Manual
th: คู่มือสำหรับผู้ใช้

source: This manual documents the Jamulus Client application for use by musicians and singers using the software to connect to a server.
th: คู่มือนี้จัดทำขึ้นเพื่ออธิบายการใช้งานตัวไคลเอนต์ Jamulus สำหรับนักดนตรีและนักร้องที่ใช้ซอฟต์แวร์นี้เพื่อเชื่อมต่อกับเซิร์ฟเวอร์

source: <summary>Table of contents</summary>
th: <summary>สารบัญ</summary>

source: Main Window
th: หน้าต่างหลัก

source: <figure> <img src="{% include img/en-screenshots/main-screen-medium.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Image of the Jamulus main window"> <figcaption>Your local mix when connected to a Server</figcaption> </figure>
th: <figure> <img src="{% include img/th-screenshots/main-screen-medium.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Image of the Jamulus main window"> <figcaption>หน้าจอมิกเซอร์ของคุณเมื่อเชื่อมต่อกับเซิร์ฟเวอร์</figcaption> </figure>

source: Ping, Delay and Jitter
th: Ping, Delay และ Jitter

source: **Ping** shows your network latency in milliseconds, the lower the better. Ping time contributes to overall delay (see below). The most probable cause of a high ping is that your distance to the server is too large.
th: **Ping** แสดงค่าดีเลย์ (latency) ของเครือข่ายของคุณเป็นหน่วยมิลลิวินาที ยิ่งตัวเลขนี้น้อยก็ยิ่งดี ค่า ping time จะมีผลต่อค่า delay โดยรวม (ดูรายละเอียดด้านล่าง) สาเหตุที่เป็นไปได้มากที่สุดที่ทำค่า ping สูง คือระยะทางจากคุณไปยังเซิร์ฟเวอร์ไกลเกินไป

source: **Delay** shows overall latency calculated from the current ping time and the delay introduced by the current audio buffer settings. The LEDs show the status of this as:
th: **Delay** แสดงค่า latency โดยรวม ซึ่งคำนวณจากค่า ping time ล่าสุด รวมกับดีเลย์ที่เกิดจากการตั้งค่า audio buffer โดยสัญญาณไฟ LED จะแสดงสถานะดังนี้:

source: <figure><img src="{% include img/en-screenshots/led-green.inc %}" style="float:left; margin-right:10px;" loading="lazy" alt="Image of a green LED symbol"></figure>
th: <figure><img src="{% include img/th-screenshots/led-green.inc %}" style="float:left; margin-right:10px;" loading="lazy" alt="Image of a green LED symbol"></figure>

source: **Green** - The delay is perfect for a jam session
th: **สีเขียว** - ค่า delay เหมาะสมที่สุดสำหรับการเล่นดนตรีร่วมกัน

source: <figure><img src="{% include img/en-screenshots/led-yellow.inc %}" style="float:left; margin-right:10px;" loading="lazy" alt="Image of a yellow LED symbol"></figure>
th: <figure><img src="{% include img/th-screenshots/led-yellow.inc %}" style="float:left; margin-right:10px;" loading="lazy" alt="Image of a yellow LED symbol"></figure>

source: **Yellow** - A session is still possible but it may be harder to play
th: **สีเหลือง** - ยังสามารถเล่นดนตรีร่วมกันได้ แต่การเล่นให้ตรงจังหวะอาจจะยากขึ้น

source: <figure><img src="{% include img/en-screenshots/led-red.inc %}" style="float:left; margin-right:10px; clear: both;" loading="lazy" alt="Image of a green red symbol"></figure>
th: <figure><img src="{% include img/th-screenshots/led-red.inc %}" style="float:left; margin-right:10px; clear: both;" loading="lazy" alt="Image of a green red symbol"></figure>

source: **Red** - The delay is too large for jamming
th: **สีแดง** - ค่า delay สูงเกินไปสำหรับการเล่นดนตรีร่วมกัน

source: **Jitter** shows the current audio/streaming status. If the light is **red**, the audio stream is interrupted. This is caused by one of the following problems:
th: **Jitter** แสดงสถานะปัจจุบันของการสตรีมเสียง หากสัญญาณไฟเป็น **สีแดง** แสดงว่าการสตรีมเสียงถูกขัดจังหวะ ซึ่งอาจเกิดจากปัญหาใดปัญหาหนึ่งต่อไปนี้:

source: The network jitter buffer is not large enough for the current network/audio interface jitter.
th: network jitter buffer มีขนาดเล็กเกินไปสำหรับเครือข่ายหรือออดิโออินเตอร์เฟสที่คุณใช้อยู่

source: The sound card's buffer delay (buffer size) is too small (see Settings window).
th: buffer delay (buffer size) ของการ์ดเสียงมีขนาดเล็กเกินไป (ดูหน้าต่าง Settings)

source: The upload or download stream rate is too high for your internet bandwidth.
th: โปรแกรมกำลังพยายามถ่ายโอนข้อมูล (อัปโหลดหรือดาวน์โหลด) ในอัตราที่สูงเกินกว่าอินเทอร์เน็ตแบนด์วิดท์ของคุณ

source: The CPU of the Client or server is at 100%.
th: CPU ของไคลเอนต์หรือเซิร์ฟเวอร์ทำงานอยู่ที่ 100%

source: Input
th: อินพุต

source: Shows the level of the two stereo channels for your audio input. Make sure not to clip the input signal to avoid distortions of your sound (the LEDs will indicate clipping when it occurs).
th: แสดงระดับเสียงของช่องสเตอริโอทั้งสองช่องสำหรับอินพุตเสียงของคุณ ตรวจสอบให้แน่ใจว่าสัญญาณอินพุตไม่ดังเกินไปจนเกิดการ clipping เพื่อหลีกเลี่ยงอาการเสียงแตก (ไฟ LED อันบนสุดจะขึ้นสีแดงเมื่อเกิดการ clipping)

source: Mute Myself button
th: ปุ่ม Mute Myself

source: Cuts your audio stream to the server so that you will be able to hear yourself and see your own input levels, but other musicians will not. Be aware that other musicians will not know if you have muted yourself.
th: ตัดการสตรีมเสียงของคุณไปยังเซิร์ฟเวอร์ เพื่อให้คุณสามารถได้ยินเสียงตัวเองและเห็นระดับเสียงอินพุตของคุณเองได้ แต่นักดนตรีคนอื่นๆ จะไม่ได้ยิน โปรดทราบว่านักดนตรีคนอื่นๆ จะไม่รู้ว่าคุณปิดเสียงตัวเองอยู่

source: Reverb effect
th: เอฟเฟกต์ Reverb

source: Adds reverb to your local mono audio channel, or to both channels in stereo mode. The mono channel selection and the reverberation level can be modified. For example, if a microphone signal is fed in to the right audio channel of the sound card and a reverb effect needs to be applied, set the channel selector to the right and move the fader upwards until the desired reverb level is reached.
th: เพิ่ม reverb ให้กับช่องสัญญาณเสียงโมโนของคุณ หรือทั้งสองช่องสัญญาณในโหมดสเตอริโอ คุณสามารถปรับแต่งการเลือกช่องสัญญาณโมโนและระดับ reverb ได้ ตัวอย่างเช่น หากสัญญาณไมโครโฟนถูกป้อนเข้าไปในช่องสัญญาณเสียงด้านขวา และต้องการใส่เอฟเฟกต์ reverb ให้ตั้งค่าตัวเลือกช่องสัญญาณเป็น Right และเลื่อนเฟดเดอร์ขึ้นจนกว่าจะถึงระดับ reverb ที่ต้องการ

source: Opens the chat window. Text entered is sent to all connected Clients. If a new chat message arrives and the Chat dialogue is not already open, it will open automatically for all Clients. See Settings to optionally turn on a sound alert when a new chat message arrives.
th: เปิดหน้าต่างแชท ข้อความที่ป้อนจะถูกส่งไปยังไคลเอนต์ทั้งหมดที่เชื่อมต่ออยู่ หากมีข้อความแชทใหม่เข้ามาและหน้าต่างแชทยังไม่ได้เปิดอยู่ หน้าต่างแชทจะเปิดขึ้นโดยอัตโนมัติสำหรับไคลเอนต์ทั้งหมด หากต้องการเปิดใช้งานเสียงแจ้งเตือนเมื่อมีข้อความแชทใหม่เข้ามา สามารถตั้งค่าได้ในหน้าต่าง Settings

source: Connect/disconnect button
th: ปุ่มเชื่อมต่อ/ยกเลิกการเชื่อมต่อ

source: Opens a dialogue where you can select a server to connect to. If you are connected, pressing this button will end the session. You can also open the dialogue using "File&gt;Connection Setup...". This will leave you connected to any current session until you join another.
th: เปิดหน้าต่างที่คุณสามารถเลือกเซิร์ฟเวอร์เพื่อเชื่อมต่อได้ หากคุณเชื่อมต่ออยู่ การกดปุ่มนี้จะเป็นการตัดการเชื่อมต่อ คุณยังสามารถเปิดหน้าต่างนี้ได้โดยเลือกเมนู "File&gt;Connection Setup..." ซึ่งจะช่วยให้คุณสามารถดูรายชื่อเซิร์ฟเวอร์ได้ โดยยังคงเชื่อมต่ออยู่กับเซิร์ฟเวอร์ปัจจุบัน จนกว่าคุณจะย้ายไปเซิร์ฟเวอร์อื่น

source: <figure><img src="{% include img/en-screenshots/connection-setup-window.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Screenshot of the server connection window"></figure>
th: <figure><img src="{% include img/th-screenshots/connection-setup-window.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Screenshot of the server connection window"></figure>

source: The Connection Setup window shows a list of available Servers together with their "distance" (in terms of ping time), the number of occupants and the maximum number supported, and the Server's given location. Permanent Servers (those that have been listed for longer than 24 hours) are shown in bold.
th: หน้าต่าง Connection Setup จะแสดงรายชื่อเซิร์ฟเวอร์ที่ใช้งานได้ พร้อมกับ "ระยะทาง" (ในแง่ของ ping time) จำนวนผู้ใช้งานปัจจุบัน จำนวนผู้ใช้งานสูงสุดที่เซิร์ฟเวอร์รองรับ และตำแหน่งที่ตั้งของเซิร์ฟเวอร์ โดยเซิร์ฟเวอร์ที่อยู่ในรายชื่อนี้มาแล้วนานกว่า 24 ชั่วโมงติดต่อกัน จะแสดงเป็นตัวหนา

source: Click on the Server you want to join and press the Connect button to connect to it. Alternatively, double-click on the server name.
th: คลิกที่เซิร์ฟเวอร์ที่คุณต้องการเข้าร่วม แล้วกดปุ่ม Connect เพื่อเชื่อมต่อ หรือดับเบิลคลิกที่ชื่อเซิร์ฟเวอร์

source: Server operators register their servers with Directories. These are either genre-specific or for any genre, or additional [custom entries](#custom-directories). Use the Directory dropdown to select a genre. You can filter the list by server name or location. To list only occupied Servers, enter a "#" character. If you choose "Show All Musicians" the current occupants will be shown.
th: ผู้ดูแลเซิร์ฟเวอร์จะลงทะเบียนเซิร์ฟเวอร์ของตนกับ Directory บางอันเปิดไว้สำหรับบางแนวเพลงโดยเฉพาะ บางอันจะเปิดสำหรับทุกแนวเพลง (any genre) และอาจมี [custom entries](#custom-directories) เพิ่มเติมหากได้ตั้งค่าไว้ คุณสามารถเปลี่ยน Directory โดยเลือก genre ที่กล่องด้านบน คุณสามารถกรองรายชื่อตามชื่อเซิร์ฟเวอร์หรือตำแหน่ง หากต้องการแสดงเฉพาะเซิร์ฟเวอร์ที่มีคนใช้งานอยู่ ให้ป้อนอักขระ "#" หากคุณเลือก "Show All Musicians" จะมีการแสดงรายชื่อผู้ใช้งานปัจจุบันด้วย

source: If you know the hostname or IP address of a private Server, you can connect to it using the "Server Address" field. An optional port number can be added after the address using a colon as a separator, e.g, `jamulus.example.com:22124`. (Note that IPv6 addresses must be entirely enclosed in square brackets, for example `[::1]:22124`.) The field will also show a list of the most recently used server addresses. The button that follows the field allows the current entry to be removed from the list.
th: หากคุณทราบ IP address หรือ hostname ของเซิร์ฟเวอร์ส่วนตัว คุณสามารถเชื่อมต่อกับเซิร์ฟเวอร์นั้นได้โดยใส่ในช่อง "Server Address" คุณสามารถเพิ่มหมายเลขพอร์ตต่อท้าย address ได้ โดยใช้เครื่องหมายโคลอนเป็นตัวคั่น เช่น `jamulus.example.com:22124` (โปรดทราบว่า IP address แบบ IPv6 ต้องอยู่ในวงเล็บก้ามปู เช่น `[::1]:22124`) ช่องนี้จะแสดงรายชื่อ address ของเซิร์ฟเวอร์ที่เพิ่งใช้งานล่าสุด ปุ่มที่อยู่ถัดจากช่องนี้ช่วยให้คุณสามารถลบรายการปัจจุบันออกจากรายชื่อได้

source: Server audio mixer
th: มิกเซอร์เสียงของเซิร์ฟเวอร์

source: <figure><img src="{% include img/en-screenshots/mixer-channels.inc %}" style="float:left; margin-right:10px; margin-bottom:20px; border: 5px solid grey;" loading="lazy" alt="Image of a pair of server mixer controls"></figure>
th: <figure><img src="{% include img/th-screenshots/mixer-channels.inc %}" style="float:left; margin-right:10px; margin-bottom:20px; border: 5px solid grey;" loading="lazy" alt="Image of a pair of server mixer controls"></figure>

source: The audio mixer screen shows each user connected to the server (including yourself). The faders allow you to adjust the level of what you hear without affecting what others hear.
th: หน้าจอมิกเซอร์ จะแสดงผู้ใช้แต่ละคนที่เชื่อมต่อกับเซิร์ฟเวอร์ (รวมถึงตัวคุณเอง) คุณสามารถใช้เฟดเดอร์เพื่อปรับระดับเสียงที่คุณจะได้ยิน โดยไม่ส่งผลกระทบต่อเสียงที่คนอื่นได้ยิน

source: The VU meter shows the input level at the server - that is, the sound being sent.
th: VU meter แสดงระดับเสียงอินพุตที่เซิร์ฟเวอร์ได้รับ นั่นคือเสียงที่กำลังถูกส่ง

source: If you have set your Audio Channel to Stereo or Stereo Out in your Settings, you will also see a pan control (shift-click to reset).
th: หากคุณตั้งค่า Audio Channel เป็น Stereo หรือ Stereo Out ใน Settings คุณจะเห็นตัวควบคุม pan (กด shift ค้างไว้แล้วคลิกเพื่อรีเซ็ต)

source: If you see a "mute" icon above a user, it means that person cannot hear you. Either they have muted you, soloed one or more users not including you, or have set your fader in their mix to zero.
th: หากคุณเห็นไอคอน "mute" แสดงเหนือผู้ใช้ แสดงว่าบุคคลนั้นไม่ได้ยินเสียงคุณ อาจเป็นเพราะพวกเขาปิดเสียงคุณ หรือตั้งค่า Solo ให้กับผู้ใช้คนอื่นๆ โดยที่ไม่ได้รวมคุณไว้ด้วย หรือตั้งค่าเฟดเดอร์ของคุณในมิกซ์ของพวกเขาไว้ที่ตำแหน่งล่างสุด

source: Users usually appear left-to-right in the order that they connect. When joining a server that already has participants, the default order depends on the versions of Jamulus at the client and the server. With a client version before 3.12.0 or a server version older than 3.5.5, the existing participants will be shown before your own fader channel. With a client of 3.12.0 or later connected to a server of 3.5.5 or newer, your own fader will be shown first, with the other existing participants shown to the right. In either case, participants joining subsequently will by default appear to the right of all the existing participants.
th: โดยปกติแล้ว รายชื่อผู้ใช้จะเรียงจากซ้ายไปขวาตามลำดับที่พวกเขาเชื่อมต่อเข้ามา เมื่อเข้าร่วมเซิร์ฟเวอร์ที่มีผู้เข้าร่วมอยู่แล้ว ลำดับการแสดงผลเริ่มต้นจะขึ้นอยู่กับเวอร์ชันของ Jamulus ทั้งของไคลเอนต์และเซิร์ฟเวอร์ หากเวอร์ชันไคลเอนต์ก่อน 3.12.0 หรือเวอร์ชันเซิร์ฟเวอร์เก่ากว่า 3.5.5 ผู้เข้าร่วมเดิมจะแสดงก่อนช่องเฟดเดอร์ของคุณเอง แต่หากไคลเอนต์เวอร์ชัน 3.12.0 ขึ้นไปเชื่อมต่อกับเซิร์ฟเวอร์เวอร์ชัน 3.5.5 ขึ้นไป เฟดเดอร์ของคุณเองจะแสดงก่อน โดยผู้เข้าร่วมเดิมจะแสดงทางด้านขวา ในทั้งสองกรณี ผู้เข้าร่วมที่เข้าร่วมในภายหลังจะปรากฏทางด้านขวาของผู้เข้าร่วมเดิมทั้งหมดตามค่าเริ่มต้น

source: You can override this order and sort instead by name, instrument, group, city or channel number using the View menu. See Menu Commands below.
th: คุณสามารถตั้งค่าให้โปรแกรมเรียงลำดับผู้ใช้ตามชื่อ เครื่องดนตรี กลุ่ม เมือง หรือหมายเลขช่องสัญญาณแทนได้ โดยเลือกเมนู View แล้วดูคำสั่งเมนูเพิ่มเติมด้านล่าง

source: If the server operator has enabled recording, you will see a message above the mixer showing that you are being recorded.
th: หากผู้ดูแลเซิร์ฟเวอร์เปิดใช้งานระบบบันทึกเสียง คุณจะเห็นข้อความเหนือมิกเซอร์ที่ระบุว่ากำลังมีการบันทึกเสียงของคุณอยู่

source: Grp button
th: ปุ่ม Grp

source: You can group users together using the "group" toggle. Moving the fader of any member of the group will move the other faders in that group by the same amount. You can isolate a channel from the group temporarily with shift-click-drag. Up to 8 groups can be defined.
th: คุณสามารถจัดกลุ่มผู้ใช้เข้าด้วยกันได้โดยใช้ปุ่ม "group" การเลื่อนเฟดเดอร์ของสมาชิกคนใดคนหนึ่งในกลุ่ม จะเป็นการเลื่อนเฟดเดอร์อื่นๆ ในกลุ่มนั้นด้วยในปริมาณที่เท่ากัน คุณสามารถแยกช่องสัญญาณออกจากกลุ่มได้ชั่วคราวโดยกด shift ค้างไว้แล้วคลิกลาก คุณสามารถกำหนดกลุ่มได้สูงสุด 8 กลุ่ม

source: Mute button
th: ปุ่ม Mute

source: Prevents users being heard in your local mix. Be aware that when you mute someone, they will see a "muted" icon above your fader to indicate that you cannot hear them. Note also that you will continue to see their VU meters moving if sound from the muted user is reaching the server. Your fader position for them is also unaffected.
th: ปิดเสียงช่องนั้นในมิกซ์ของคุณ โปรดทราบว่า เมื่อคุณปิดเสียงใครบางคน พวกเขาจะเห็นไอคอน "muted" แสดงเหนือเฟดเดอร์ของคุณ เพื่อระบุว่าคุณไม่ได้ยินเสียงพวกเขา และโปรดทราบว่า คุณจะยังคงเห็น VU meter ของพวกเขาขยับอยู่เมื่อเขาส่งเสียงไปยังเซิร์ฟเวอร์ ตำแหน่งเฟดเดอร์ของคุณสำหรับพวกเขาก็จะไม่ได้รับผลกระทบเช่นกัน

source: Note that muting your **own** channel only means you will not hear your signal from the server (and is not advised as it can lead to you becoming out of time with other players). This is therefore not the same as using "[Mute Myself](#mute-myself-button)".
th: โปรดทราบว่า การปิดเสียงช่องสัญญาณของคุณ**เอง** หมายความว่าคุณจะไม่ได้ยินเสียงของคุณที่ส่งกลับมาจากเซิร์ฟเวอร์ (ซึ่งไม่แนะนำให้ทำ เพราะอาจทำให้คุณเล่นไม่ตรงจังหวะกับผู้เล่นคนอื่นๆ) ดังนั้น การปิดเสียงช่องสัญญาณของคุณเอง จึงไม่เหมือนกับการใช้คำสั่ง "[Mute Myself](#mute-myself-button)"

source: Solo button
th: ปุ่ม Solo

source: Allows you to hear one or more users on their own. Those not soloed will be muted. Note also that those people who are not soloed will see a "muted" icon above your fader.
th: ช่วยให้คุณสามารถฟังเฉพาะเสียงของผู้ใช้หนึ่งคนหรือหลายคนได้ ผู้ใช้ที่ไม่ได้ตั้งค่า Solo จะถูกปิดเสียง และโปรดทราบว่า ผู้ใช้ที่ไม่ได้ตั้งค่า Solo จะเห็นไอคอน "muted" แสดงเหนือเฟดเดอร์ของคุณ

source: Menu commands
th: คำสั่งเมนู

source: Opens the [connection dialogue (see above)](#connectdisconnect-button).
th: เปิด[หน้าต่างเชื่อมต่อ (ดูด้านบน)](#connectdisconnect-button)

source: You can save and restore the mix you have for your band. This stores your settings for each person's fader volume, pan setting, mute and solo state. You can load this mix any time (even while you are playing). Loading can also be done by drag/drop to the mixer window.
th: คุณสามารถบันทึกและโหลดการตั้งค่ามิกเซอร์ที่คุณตั้งค่าไว้สำหรับวงดนตรีของคุณได้ ซึ่งจะบันทึกการตั้งค่าระดับเสียงเฟดเดอร์ การตั้งค่า pan สถานะปิดเสียง และสถานะโซโลของแต่ละคน คุณสามารถโหลดการตั้งค่ามิกเซอร์นี้ได้ทุกเมื่อ (แม้ในขณะที่คุณกำลังเล่น) นอกจากนี้ คุณยังสามารถโหลดการตั้งค่ามิกเซอร์ได้โดยการลากไฟล์มาวางลงในหน้าต่างมิกเซอร์

source: Closes all the windows and exits the application.
th: ปิดหน้าต่างทั้งหมดและออกจากแอปพลิเคชัน

source: Whenever you Solo or Mute a channel, Jamulus remembers these settings. Even if that person leaves and rejoins - or you join a server where they are playing - the settings will automatically be applied. Use this command to clear _all_ these stored settings.
th: เมื่อใดก็ตามที่คุณตั้งค่า Solo หรือ Mute ให้กับช่องสัญญาณ, Jamulus จะจดจำการตั้งค่าเหล่านี้ แม้ว่าบุคคลนั้นจะออกจากเซิร์ฟเวอร์แล้วกลับเข้าร่วมใหม่ หรือคุณเข้าร่วมเซิร์ฟเวอร์ที่พวกเขากำลังเล่นอยู่ การตั้งค่าเหล่านี้จะถูกนำไปใช้โดยอัตโนมัติ ใช้คำสั่งนี้เพื่อล้างการตั้งค่าที่บันทึกไว้ทั้งหมด

source: Applies the [configured "New Client Level"](#new-client-level) to all currently connected channels.
th: ปรับระดับเสียงของทุกๆ คนที่เชื่อมต่ออยู่ ให้มีความดังเท่ากับการตั้งค่า ["New Client Level" ที่กำหนดค่าไว้](#new-client-level)

source: Applies a one-off fader adjustment to each channel depending on its volume. Useful for large ensembles to get a reasonable overall mix, although individual adjustments might still be necessary. Best applied during a warm-up or a uniform part of the music piece.
th: ปรับเฟดเดอร์ของแต่ละช่องสัญญาณโดยอัตโนมัติตามระดับเสียง มีประโยชน์สำหรับวงดนตรีขนาดใหญ่ในการปรับมิกซ์โดยรวม แม้ว่าอาจยังคงต้องมีการปรับแต่งเพิ่มเติม ควรใช้ในช่วงวอร์มอัพ หรือช่วงที่ทุกคนกำลังเล่นดนตรีพร้อมๆ กัน

source: View > (sort options)
th: View > (ตัวเลือกการเรียงลำดับ)

source: Most items under the "View" menu allow you to adjust the order Jamulus chooses to display channels on the server: * Own Fader First<br/> This option can be used in addition to the others to move your own channel to always be the leftmost, irrespective of the sort order of the other channels.
th: รายการส่วนใหญ่ในเมนู "View" ช่วยให้คุณสามารถปรับการเรียงลำดับช่องสัญญาณบนเซิร์ฟเวอร์ได้: * Own Fader First<br/> ตัวเลือกนี้สามารถใช้ร่วมกับตัวเลือกอื่นๆ เพื่อให้ช่องสัญญาณของคุณเองอยู่ทางซ้ายสุดเสมอ โดยไม่คำนึงถึงลำดับการเรียงลำดับของช่องสัญญาณอื่นๆ

source: * No user sorting<br/> This does not take any user details into account when sorting. It sorts by the order channels join the current server as described further up, with new channels being added to the right-hand end. * Sort by Name<br/> Sorts by the name someone has chosen in their profile. * Sort by Instrument / City<br/> Sorts by the instrument or city someone has in their profile, along with their name. * Sort by Group<br/> Where the fader group feature is in use, this sorts in ascending group number from left to right (and within that, by name), with any ungrouped channels off to the right. * Sort by Channel<br/> Where Jamulus channel controls (fader, mute, solo, etc) are being controlled by MIDI (see [Using --ctrlmidich for MIDI controllers](Tips-Tricks-More#using-ctrlmidich-for-midi-controllers)), this sorts by the channel number to help ensure a stable sort order that aligns with MIDI hardware controls. Note that in Jamulus clients before version 3.12.0, channel numbers are assigned directly by the server. Clients from 3.12.0 onwards manage their own channel number assignments and always assign channel 0 to the local user (provided the server version is at least 3.5.5).
th: * No user sorting<br/> การเรียงลำดับนี้จะไม่นำรายละเอียดผู้ใช้มาพิจารณา โปรแกรมจะเรียงลำดับตามลำดับที่ช่องสัญญาณเข้าร่วมเซิร์ฟเวอร์ตามที่อธิบายไว้ข้างต้น โดยช่องสัญญาณใหม่จะถูกเพิ่มไปทางขวาสุด * Sort by Name<br/> เรียงลำดับตามชื่อที่ผู้ใช้ระบุไว้ในโปรไฟล์ * Sort by Instrument / City<br/> เรียงลำดับตามเครื่องดนตรีหรือเมืองที่ผู้ใช้ระบุไว้ในโปรไฟล์ กรณีที่ชื่อเมืองหรือเครื่องดนตรีตรงกัน จะเรียงลำดับชื่อของพวกเขา * Sort by Group<br/> หากมีการใช้คุณสมบัติการจัดกลุ่มเฟดเดอร์ การเรียงลำดับนี้จะเรียงตามหมายเลขกลุ่มจากน้อยไปมากจากซ้ายไปขวา (และภายในกลุ่มนั้นจะเรียงตามชื่อ) โดยช่องสัญญาณที่ไม่ได้จัดกลุ่มจะอยู่ทางขวาสุด * Sort by Channel<br/> หากมีการตั้งให้สามารถควบคุม Jamulus (fader, mute, solo และอื่นๆ) ด้วย MIDI (ดูที่ [Using --ctrlmidich for MIDI controllers](Tips-Tricks-More#using-ctrlmidich-for-midi-controllers)) การเรียงลำดับนี้จะเรียงตามหมายเลขช่องสัญญาณ เพื่อให้แน่ใจว่าลำดับการเรียงลำดับมีความเสถียรและสอดคล้องกับการควบคุมฮาร์ดแวร์ MIDI โปรดทราบว่าในไคลเอนต์ Jamulus ก่อนเวอร์ชัน 3.12.0 หมายเลขช่องสัญญาณจะถูกกำหนดโดยเซิร์ฟเวอร์โดยตรง แต่ไคลเอนต์ตั้งแต่เวอร์ชัน 3.12.0 เป็นต้นไป จะจัดการการกำหนดหมายเลขช่องสัญญาณด้วยตัวเอง และจะกำหนดช่องสัญญาณ 0 ให้กับผู้ใช้ท้องถิ่นเสมอ (หากเซิร์ฟเวอร์เป็นเวอร์ชัน 3.5.5 ขึ้นไป)

source: Opens the [Chat](#chat) window.
th: เปิดหน้าต่าง [Chat](#chat)

source: Settings Menu
th: เมนู Settings

source: Allows direct access to each of the [Settings](#settings) tabs.
th: ช่วยให้คุณสามารถเข้าถึงแท็บ [Settings](#settings) แต่ละแท็บได้โดยตรง

source: Provides access to the [Getting Started](Getting-Started) and [User Manual](Software-Manual) (this page) on the website, along with copyright, licence and acknowledgement details. There is also a "What's This?" option for getting more details on parts of the client display.
th: ให้คุณสามารถเข้าถึง [เริ่มต้นใช้งาน](Getting-Started) และ [คู่มือสำหรับผู้ใช้](Software-Manual) (หน้านี้) บนเว็บไซต์ พร้อมกับรายละเอียดลิขสิทธิ์ สิทธิ์การใช้งาน และการแสดงความขอบคุณ นอกจากนี้ยังมีตัวเลือก "What's This?" สำหรับดูรายละเอียดเพิ่มเติมเกี่ยวกับส่วนต่างๆ ของหน้าจอไคลเอนต์

source: From the Settings menu, select "My Profile..." to set your Alias/Name which is displayed below your fader in the server audio mixer board.
th: จากเมนู Settings เลือก "My Profile..." เพื่อตั้งค่า Alias/Name (ชื่อ/ฉายา) ของคุณ ซึ่งจะแสดงอยู่ใต้เฟดเดอร์ของคุณในมิกเซอร์เสียงของเซิร์ฟเวอร์

source: <figure><img src="{% include img/en-screenshots/settings-profile.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Image of a profile window"></figure>
th: <figure><img src="{% include img/th-screenshots/settings-profile.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Image of a profile window"></figure>

source: If you set an instrument and/or country, icons for these selections will also be shown below your fader. The skill setting changes the background colour of the fader tag and the city entry shows up in the tool tip of the fader tag:
th: หากคุณได้ตั้งค่า Instrument และ/หรือ Country/Region ไอคอนสำหรับสิ่งที่คุณเลือกเหล่านี้จะแสดงอยู่ใต้เฟดเดอร์ของคุณด้วย การตั้งค่า skill จะเปลี่ยนสีพื้นหลังของแท็กเฟดเดอร์ และรายการ City จะแสดงใน tooltip เมื่อเอาเมาส์จ่อไว้ที่ป้ายชื่อบนเฟดเดอร์:

source: <figure><img src="{% include img/en-screenshots/profile-tooltip.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Image of a tooltip showing profile information"></figure>
th: <figure><img src="{% include img/th-screenshots/profile-tooltip.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Image of a tooltip showing profile information"></figure>

source: This applies a skin to the main window, some of which are designed to accommodate larger ensembles.
th: เลือกใช้ skin กับหน้าต่างหลัก ซึ่ง skin บางแบบได้รับการออกแบบมาเพื่อรองรับวงดนตรีขนาดใหญ่

source: Meter style
th: รูปแบบ Meter
