Repository: weblate/jamuluswebsite
Catalog: _translator-files/po/*/Software-Manual.po
Languages: th

source: This changes the visual style of the audio meters, independently of the chosen skin.
th: เปลี่ยนรูปแบบของ audio meter โดยไม่ขึ้นกับ skin ที่เลือก

source: This sets the number of rows displayed in the server audio mixer, for use with larger ensembles.
th: ตั้งค่าจำนวนแถวที่แสดงในมิกเซอร์เสียงของเซิร์ฟเวอร์ สำหรับใช้กับวงดนตรีขนาดใหญ่

source: This turns on a sound alert for when someone joins a Server, or when receiving a new chat message.
th: เปิดใช้งานเสียงแจ้งเตือนเมื่อมีคนเข้าร่วมเซิร์ฟเวอร์ หรือเมื่อได้รับข้อความแชทใหม่

source: <figure><img src="{% include img/en-screenshots/settings-network.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Image of audio/network settings window"></figure>
th: <figure><img src="{% include img/th-screenshots/settings-network.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Image of audio/network settings window"></figure>

source: Under the Windows operating system the ASIO driver (sound card) can be selected using Jamulus. If the selected ASIO driver is not valid an error message is shown and the previous valid driver is selected. Under macOS the input and output hardware can be selected.
th: ในระบบปฏิบัติการ Windows คุณสามารถเลือกไดรเวอร์ ASIO (การ์ดเสียง) ที่จะใช้กับ Jamulus ได้ หากไดรเวอร์ ASIO ที่เลือกไม่ถูกต้อง จะมีข้อความแสดงข้อผิดพลาดปรากฏขึ้น และไดรเวอร์ที่ถูกต้องก่อนหน้านี้จะถูกเลือก ใน macOS คุณสามารถเลือกฮาร์ดแวร์อินพุตและเอาต์พุตได้

source: <figure><img src="{% include img/en-screenshots/channel-mapping.inc %}" style="float:left; margin-right:10px; margin-bottom:20px;" loading="lazy" alt="Image of Input and output channel mapping"></figure>
th: <figure><img src="{% include img/th-screenshots/channel-mapping.inc %}" style="float:left; margin-right:10px; margin-bottom:20px;" loading="lazy" alt="Image of Input and output channel mapping"></figure>

source: If the selected sound card device offers more than one input or output channel, the _Input Channel Mapping and Output Channel Mapping_ settings are visible. For each Jamulus input/output channel (left and right channel) a different actual sound card channel can be selected.
th: หากอุปกรณ์การ์ดเสียงที่เลือกมีช่องสัญญาณอินพุตหรือเอาต์พุตมากกว่าหนึ่งช่อง การตั้งค่า _Input Channel Mapping และ Output Channel Mapping_ จะปรากฏขึ้น คุณสามารถเลือกช่องสัญญาณการ์ดเสียงที่แตกต่างกันสำหรับช่องสัญญาณอินพุต/เอาต์พุต Jamulus แต่ละช่อง (ช่องสัญญาณซ้ายและขวา) ได้

source: Selects the number of audio channels to be used for communication between Client and Server.
th: เลือกจำนวนช่องสัญญาณเสียงที่จะใช้สำหรับการสื่อสารระหว่างไคลเอนต์และเซิร์ฟเวอร์

source: **Note**: It is better to run separate Client instances per voice/instrument, where each Client has its own ini file, rather than using this built-in mono pair to stereo mixer.
th: **หมายเหตุ**: การรันไคลเอนต์แยกกันสำหรับแต่ละเสียง/เครื่องดนตรี โดยที่ไคลเอนต์แต่ละรายมีไฟล์ ini ของตัวเอง จะดีกว่าการใช้ไคลเอนต์ตัวเดียวแล้วมิกซ์เสียงโมโนคู่เป็นสเตอริโอ

source: There are three modes available:
th: มีสามโหมดให้เลือก:

source: **Mono** and **Stereo** modes use one and two audio channels respectively.
th: โหมด **Mono** และ **Stereo** ใช้ช่องสัญญาณเสียงหนึ่งช่องและสองช่องตามลำดับ

source: **Mono-in/Stereo-out**: The audio signal sent to the server is mono but the return signal is stereo. This is useful if the sound card has the instrument on one input channel and the microphone on the other. In that case the two input signals can be mixed to one mono channel but the server mix is heard in stereo.
th: **Mono-in/Stereo-out**: สัญญาณเสียงที่ส่งไปยังเซิร์ฟเวอร์เป็นแบบโมโน แต่สัญญาณที่ส่งกลับมาเป็นแบบสเตอริโอ ซึ่งมีประโยชน์หากการ์ดเสียงมีเครื่องดนตรีอยู่ที่ช่องสัญญาณอินพุตหนึ่งช่อง และไมโครโฟนอยู่ที่อีกช่องสัญญาณหนึ่ง ในกรณีนี้ สัญญาณอินพุตทั้งสองสามารถมิกซ์เป็นช่องสัญญาณโมโนช่องเดียวได้ แต่เสียงมิกซ์จากเซิร์ฟเวอร์จะได้ยินเป็นแบบสเตอริโอ

source: Enabling stereo mode will increase your stream's data rate. Make sure your upload rate does not exceed the available upload speed of your internet connection.
th: การเปิดใช้งานโหมดสเตอริโอจะเพิ่มอัตราการส่งข้อมูลของสตรีมของคุณ ตรวจสอบให้แน่ใจว่าอัตราการอัปโหลดของคุณไม่เกินความเร็วในการอัปโหลดของการเชื่อมต่ออินเทอร์เน็ตของคุณ

source: In stereo streaming mode, no audio channel selection for the reverb effect will be available on the main window since the effect is applied to both channels in this case.
th: ในโหมดสตรีมมิ่งแบบสเตอริโอ จะไม่มีตัวเลือกช่องสัญญาณเสียงสำหรับเอฟเฟกต์ reverb ในหน้าต่างหลัก เนื่องจากเอฟเฟกต์จะถูกนำไปใช้กับทั้งสองช่องสัญญาณ

source: Audio quality
th: คุณภาพเสียง

source: The higher the audio quality, the higher your audio stream's data rate. Make sure your upload rate does not exceed the available upload speed of your internet connection.
th: ยิ่งคุณภาพเสียงสูงเท่าไหร่ อัตราการส่งข้อมูลของสตรีมเสียงของคุณก็จะยิ่งสูงขึ้นเท่านั้น ตรวจสอบให้แน่ใจว่าอัตราการอัปโหลดของคุณไม่เกินความเร็วในการอัปโหลดของการเชื่อมต่ออินเทอร์เน็ตของคุณ

source: The buffer delay setting is a fundamental setting of the Jamulus software. This setting has an influence on many connection properties. Three buffer sizes are supported:
th: การตั้งค่า buffer delay เป็นการตั้งค่าพื้นฐานของซอฟต์แวร์ Jamulus การตั้งค่านี้มีผลต่อคุณสมบัติการเชื่อมต่อหลายอย่าง โดยมี buffer size ให้เลือกสามขนาด:

source: **64 samples** Provides the lowest latency but does not work with all sound cards.
th: **64 samples** ให้ค่า latency ที่ต่ำที่สุด แต่อาจใช้งานไม่ได้กับการ์ดเสียงบางตัว

source: **128 samples** The preferred setting. Should work for most available sound cards.
th: **128 samples** เป็นการตั้งค่าที่แนะนำที่ใช้งานได้กับการ์ดเสียงส่วนใหญ่

source: **256 samples** Should only be used on very slow computers, or with a slow internet connection.
th: **256 samples** ควรใช้เฉพาะกับคอมพิวเตอร์ที่ช้ามาก หรือการเชื่อมต่ออินเทอร์เน็ตที่ช้า

source: Some sound card drivers do not allow the buffer delay to be changed from within the Jamulus software. In this case the buffer delay setting is disabled and has to be changed using the sound card driver. On Windows, press the ASIO Setup button to open the driver settings panel.
th: ไดรเวอร์การ์ดเสียงบางตัวไม่อนุญาตให้เปลี่ยน buffer delay จากภายในซอฟต์แวร์ Jamulus ในกรณีนี้ การตั้งค่า buffer delay จะถูกปิดใช้งาน และต้องเปลี่ยนโดยใช้ไดรเวอร์การ์ดเสียง ใน Windows ให้กดปุ่ม ASIO Setup เพื่อเปิดแผงการตั้งค่าไดรเวอร์

source: On Linux: - when using JACK, use `QJackCtl` to change the buffer size and restart JACK; - when using PipeWire's JACK server, change PipeWire's Quantum parameter with its own configuration tools.
th: บน Linux: - หากใช้ JACK ให้ใช้ `QJackCtl` เพื่อเปลี่ยน buffer size แล้วรีสตาร์ท JACK; - หากใช้เซิร์ฟเวอร์ JACK ของ PipeWire ให้เปลี่ยนพารามิเตอร์ Quantum ของ PipeWire ด้วยเครื่องมือกำหนดค่าของมันเอง

source: The actual buffer delay has an influence on the connection status, the current upload rate and the overall delay. The lower the buffer size, the higher the probability of a red light in the status indicator (dropouts) and the higher the upload rate and the lower the overall delay.
th: buffer delay มีผลต่อสถานะการเชื่อมต่อ อัตราการอัปโหลดปัจจุบัน และ delay โดยรวม ยิ่ง buffer size น้อยเท่าไหร่ โอกาสที่ไฟแสดงสถานะจะเป็นสีแดง (เสียงขาดๆ หายๆ) ก็จะยิ่งสูงขึ้นเท่านั้น และอัตราการอัปโหลดก็จะยิ่งสูงขึ้น ในขณะที่ delay โดยรวมก็จะยิ่งต่ำลง

source: The buffer setting is therefore a trade-off between audio quality and overall delay.
th: ดังนั้น การตั้งค่า buffer จึงเป็นการแลกเปลี่ยนกันระหว่างคุณภาพเสียงและ delay โดยรวม

source: The jitter buffer compensates for network and sound card timing jitters. The size of the buffer influences the quality of the audio stream (how many dropouts occur) and the overall delay (the longer the buffer, the higher the delay).
th: Jitter buffer ช่วยป้องกันปัญหาเสียงที่เกิดจาก network jitter และ sound card jitter ขนาดของบัฟเฟอร์จะมีผลต่อคุณภาพของเสียง (ยิ่งตั้งค่านี้ไว้น้อย โอกาสจะเกิดเสียงขาดๆ หายๆ ยิ่งเยอะ) และ delay โดยรวม (ยิ่งตั้งค่านี้ไว้เยอะ delay ก็จะยิ่งเยอะ)

source: You can set the jitter buffer size manually for your local Client and the remote server. For the local jitter buffer, dropouts in the audio stream are indicated by the light below the jitter buffer size faders. If the light turns to red, a buffer overrun/underrun has taken place and the audio stream is interrupted.
th: คุณสามารถตั้งค่า jitter buffer size ด้วยตนเองสำหรับไคลเอนต์ของคุณและเซิร์ฟเวอร์ สำหรับ jitter buffer ของไคลเอนต์ ไฟแสดงสถานะที่อยู่ใต้เฟดเดอร์ jitter buffer size จะเปลี่ยนเป็นสีแดงเมื่อเกิดเสียงขาดๆ หายๆ ซึ่งหมายความว่าเกิด buffer overrun/underrun และสตรีมเสียงถูกขัดจังหวะ

source: The jitter buffer setting is therefore a trade-off between audio quality and overall delay.
th: ดังนั้น การตั้งค่า jitter buffer จึงเป็นการแลกเปลี่ยนกันระหว่างคุณภาพเสียงและ delay โดยรวม

source: If the Auto setting is enabled, the jitter buffers of your local Client and the remote server are set automatically based on measurements of the network and sound card timing jitter. If the Auto check is enabled, the jitter buffer size faders are disabled (they cannot be moved with the mouse).
th: หากเลือกตัวเลือก Auto ตัวโปรแกรมจะตั้งค่า jitter buffer ทั้งสองให้คุณโดยอัตโนมัติตาม network jitter และ sound card jitter ที่โปรแกรมวัดได้ โดยเมื่อเลือกตัวเลือก Auto คุณจะไม่สามารถปรับการตั้งค่า jitter buffer size ได้ด้วยตัวเอง

source: Allows support for very small network audio packets. These are only used if the sound card buffer delay is smaller than 128 samples. The smaller the network buffers, the lower the audio latency. But at the same time the network load increases and the probability of audio dropouts also increases (particuarly if your network connection has any significant jitter). Try enabling this option if you are suffering from high latency or bad audio quality. However, keeping it disabled will normally mean better audio quality.
th: อนุญาตให้ใช้แพ็กเก็ตเสียงขนาดเล็กมากในการรับส่งข้อมูลผ่านเครือข่าย ซึ่งจะใช้เฉพาะเมื่อ buffer delay ของการ์ดเสียงน้อยกว่า 128 samples ยิ่ง network buffer เล็กเท่าไหร่ latency ของเสียงก็จะยิ่งต่ำลงเท่านั้น แต่ในขณะเดียวกัน ปริมาณการรับส่งข้อมูลบนเครือข่ายก็จะเพิ่มขึ้น และโอกาสที่เสียงจะขาดๆ หายๆ ก็จะเพิ่มขึ้นเช่นกัน (โดยเฉพาะอย่างยิ่งหากการเชื่อมต่อเครือข่ายของคุณมี jitter เยอะ) ลองเปิดใช้งานตัวเลือกนี้หากคุณมีปัญหา latency สูงหรือคุณภาพเสียงไม่ดี อย่างไรก็ตาม การปิดใช้งานตัวเลือกนี้ไว้จะทำให้คุณภาพเสียงดีขึ้น

source: Depends on the current audio packet size and compression setting. Make sure that the upstream rate is not higher than your available internet upload speed (check this with a service such as [librespeed.org](https://librespeed.org/)).
th: ขึ้นอยู่กับขนาดของแพ็กเก็ตเสียงและการตั้งค่าการบีบอัด ตรวจสอบให้แน่ใจว่าอัตราการอัปโหลดไม่สูงกว่าความเร็วในการอัปโหลดของการเชื่อมต่ออินเทอร์เน็ตของคุณ (ตรวจสอบได้ด้วยบริการอย่างเช่น [librespeed.org](https://librespeed.org/))

source: <figure><img src="{% include img/en-screenshots/settings-advanced.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Image of advanced settings window"></figure>
th: <figure><img src="{% include img/th-screenshots/settings-advanced.inc %}" style="border: 5px solid grey;" loading="lazy" alt="Image of advanced settings window"></figure>

source: If you need to add Directory addresses other than the built-in ones, you can do so here. Enter the hostname or IP address of the custom Directory. An optional port number can be added after the address using a colon as a separator, e.g, `jamulus.example.com:22124`. (Note that IPv6 is not currently supported for Directories.) The button that follows the field allows the current entry to be removed from the list.
th: หากคุณต้องการเพิ่ม address ของ Directory นอกเหนือจากที่มากับโปรแกรม คุณสามารถทำได้ที่นี่ ป้อน IP address หรือ hostname ของ Directory ที่คุณต้องการเพิ่ม คุณสามารถเพิ่มหมายเลขพอร์ตต่อท้าย address ได้ โดยใช้เครื่องหมายโคลอนเป็นตัวคั่น เช่น `jamulus.example.com:22124` (โปรดทราบว่า Directory ยังไม่รองรับ IPv6) ปุ่มที่อยู่ถัดจากช่องนี้ช่วยให้คุณสามารถลบรายการปัจจุบันออกจากรายชื่อได้

source: This setting defines the fader level of a newly connected Client in percent. If a new user connects to the current server, they will get the specified initial fader level if no other fader level from a previous connection of that user was already stored. You can set all users in an occupied server to this level using Edit > "Set All Faders to New Client Level".
th: กำหนดระดับเฟดเดอร์ของไคลเอนต์ที่เชื่อมต่อใหม่เป็นเปอร์เซ็นต์ หากมีผู้ใช้ใหม่เชื่อมต่อกับเซิร์ฟเวอร์ พวกเขาจะได้รับระดับเฟดเดอร์เริ่มต้นตามที่ระบุไว้หากไม่มีการบันทึกไว้ก่อนหน้านี้ คุณสามารถตั้งค่าระดับเสียงของผู้ใช้ทุกคนในเซิร์ฟเวอร์ให้เป็นระดับนี้ได้ โดยเลือก Edit > "Set All Faders to New Client Level"

source: Increases the gain from your device. Use this if your device delivers a gain that is too quiet for Jamulus.
th: เพิ่ม gain ของสัญญาณเสียงจากอุปกรณ์ของคุณ ใช้ตัวเลือกนี้หากเสียงจากอุปกรณ์ของคุณเบาเกินไปสำหรับ Jamulus

source: Attempts to detect audio feedback loops or loud noise in the first three seconds after you connected to a server. Once detected, this feature will show a message and activate the "Mute Myself" button to mute you in your own mix.
th: ตรวจจับ Feedback loop หรือเสียงรบกวนที่ดังมาก เช่นเสียงไมโครโฟนหอน ในช่วงสามวินาทีแรกหลังจากที่คุณเชื่อมต่อกับเซิร์ฟเวอร์ หากตรวจจับได้ คุณสมบัตินี้จะแสดงข้อความและเปิดใช้งานปุ่ม "Mute Myself" เพื่อปิดเสียงคุณในมิกซ์ของคุณเอง

source: Controls the relative levels of the left and right local audio channels. For a mono signal it acts as a pan between the two channels. For example, if a microphone is connected to the right input channel and an instrument is connected to the left input channel which is much louder than the microphone, move the audio fader to increase the relative volume of the mic.
th: ควบคุมระดับเสียงสัมพัทธ์ของช่องสัญญาณเสียงซ้ายและขวา สำหรับสัญญาณโมโน มันจะทำหน้าที่เป็นการ pan ระหว่างสองช่องสัญญาณ ตัวอย่างเช่น หากไมโครโฟนเชื่อมต่อกับช่องสัญญาณอินพุตด้านขวา และเครื่องดนตรีเชื่อมต่อกับช่องสัญญาณอินพุตด้านซ้าย ซึ่งดังกว่าไมโครโฟนมาก ให้เลื่อนเฟดเดอร์เสียงเพื่อเพิ่มระดับเสียงสัมพัทธ์ของไมโครโฟน

source: Backing up Jamulus
th: การสำรองข้อมูล Jamulus

source: {% include_relative Include-Backing-Up.md %} * You can save and load different mixer settings using [Load/Save Mixer Channels Setup](Software-Manual#file--loadsave-mixer-channels-setup) and store those files wherever you want.
th: {% include_relative Include-Backing-Up.md %} * คุณสามารถบันทึกและโหลดการตั้งค่ามิกเซอร์ที่แตกต่างกันได้โดยใช้ [Load/Save Mixer Channels Setup](Software-Manual#file--loadsave-mixer-channels-setup) และจัดเก็บไฟล์เหล่านั้นไว้ที่ใดก็ได้ที่คุณต้องการ

source: **Note for macOS users:** As of Jamulus 3.8.1, we have a signed installer. This will store the settings in
th: **หมายเหตุสำหรับผู้ใช้ macOS:** ตั้งแต่ Jamulus 3.8.1 เป็นต้นไป เรามีตัวติดตั้งที่ลงนามแล้ว ซึ่งจะจัดเก็บการตั้งค่าไว้ใน

source: Command Line Options
th: ตัวเลือกคอมมานด์ไลน์

source: Most common functions in Jamulus can be set using the GUI, but these and others can also be set using options given in a terminal window. Exactly how you do this will depend on your operating system.
th: ฟังก์ชันส่วนใหญ่ใน Jamulus สามารถตั้งค่าได้โดยใช้ GUI แต่คุณสามารถตั้งค่าฟังก์ชันเหล่านี้และฟังก์ชันอื่นๆ ได้โดยใช้ตัวเลือกที่กำหนดในหน้าต่าง Terminal โดยวิธีการทำจะขึ้นอยู่กับระบบปฏิบัติการของคุณ

source: For example on Windows, to use a specific settings file, right-click on the Jamulus shortcut and choose "Properties" > Target. Add the necessary arguments to Jamulus.exe:
th: ตัวอย่างเช่น บน Windows หากต้องการใช้ไฟล์การตั้งค่าเฉพาะ ให้คลิกขวาที่ทางลัด Jamulus แล้วเลือก "Properties" > Target เพิ่มอาร์กิวเมนต์ที่จำเป็นลงใน Jamulus.exe:

source: For macOS, start a Terminal window and run Jamulus with the desired options like this:
th: สำหรับ macOS ให้เปิดหน้าต่าง Terminal แล้วรัน Jamulus พร้อมกับตัวเลือกที่ต้องการดังนี้:

source: Controlling the Client via API
th: การควบคุมไคลเอนต์ผ่าน API

source: In addition to the CLI, Jamulus can be controlled using an API. This is beneficial for advanced use cases - for example, where there is no GUI, or another application needs to interact with Jamulus. Please note that the API is still experimental. Information on the [JSON-RPC API can be found in the main repository](https://github.com/jamulussoftware/jamulus/blob/main/docs/JSON-RPC.md).
th: นอกจาก CLI แล้ว คุณยังสามารถควบคุม Jamulus ได้โดยใช้ API ซึ่งมีประโยชน์สำหรับกรณีการใช้งานขั้นสูง เช่น กรณีที่ไม่มี GUI หรือแอปพลิเคชันอื่นๆ จำเป็นต้องโต้ตอบกับ Jamulus โปรดทราบว่า API ยังอยู่ในขั้นทดลอง ข้อมูลเกี่ยวกับ [JSON-RPC API สามารถดูได้ใน repository หลัก](https://github.com/jamulussoftware/jamulus/blob/main/docs/JSON-RPC.md)
