Repository: weblate/jamuluswebsite
Catalog: _translator-files/po/*/Tips-Tricks-More.po
Languages: es

source: en
es: es

source: Tips, Tricks and More
es: Consejos, Trucos y Más

source: Tips & Tricks
es: Consejos y Trucos

source: <summary>Table of contents</summary>
es: <summary>Tabla de contenidos</summary>

source: Learning about remote band rehearsing
es: Aprendiendo sobre ensayos a distancia

source: Jamulus user [Chris Rimple](https://sourceforge.net/u/chrisrimple/profile/) has compiled a massive amount of information relating to [Remote Band Rehearsals](https://docs.google.com/document/d/1smcvsxdaaViPQvGMQHmah_6BQeqowhmGSFMHfnlY2FI/) (Google doc), which covers topics such as hardware and software configuration including examples and advice for newcomers to the field. He also includes a section on Jamulus in comparison to other solutions.
es: El usuario de Jamulus [Chris Rimple](https://sourceforge.net/u/chrisrimple/profile/) ha reunido una gran cantidad de información sobre [Ensayos a Distancia](https://docs.google.com/document/d/1smcvsxdaaViPQvGMQHmah_6BQeqowhmGSFMHfnlY2FI/) (Google doc, en inglés), que cubre temas como la configuración de software y hardware, y con ejemplos y consejos para los neófitos. También incluye una sección sobre Jamulus, comparándolo con otras soluciones.

source: Using the Jamulus Client
es: Usar el cliente de Jamulus

source: Have an undisturbed session on any Server
es: Cómo tener una sesión sin molestias en cualquier Servidor

source: You can have an undisturbed session with other people on any Server by simply soloing each other. You will then not be able to hear anyone else if they enter your Server.
es: Puedes tener una sesión sin molestias con otras personas en cualquier Servidor simplemente activando la función de "solo" en aquellas personas que deseas escuchar. No escucharàs a nadie más que se una a tu Servidor.

source: **NOTE:** This does not stop people from hearing you, using the chat function, or seeing your profile information.
es: **NOTA:** Esto no impide que otras personas te escuchen, usen la función de chat, o vean la información de tu perfil..

source: Using Jamulus audio in Zoom (or other) meeting apps
es: Utilizar el audio de Jamulus en Zoom o en otras aplicaciones similares

source: Several users have reported success allowing a "virtual audience" for a Jamulus session by using [JACK audio](https://jackaudio.org) to route the Jamulus signal through JackRouter to the target application (in this case, Zoom meetings).
es: Varios usuarios han comentado que han tenido éxito a la hora de organizar un "público virtual" para una sesión de Jamulus utilizando [JACK audio](https://jackaudio.org) para conectar la señal de Jamulus a través de JackRouter a la aplicación de destino (en este caso, Zoom).

source: You can also use [VoiceMeeter](https://www.vb-audio.com/Voicemeeter/banana.htm) (Banana) for Windows or [BlackHole](https://github.com/ExistentialAudio/BlackHole) for macOS to route the Jamulus output to multiple destinations, for example to your headphones and the meeting application at the same time.
es: También puedes usar [VoiceMeeter](https://www.vb-audio.com/Voicemeeter/banana.htm) (Banana) para Windows o [BlackHole](https://github.com/ExistentialAudio/BlackHole) para macOS para conectar la salida de Jamulus a mútliples destinos; por ejemplo a tus auriculares y a la aplicación de videoconferencia a la vez.

source: Recording Jamulus on Windows with Reaper
es: Grabar Jamulus en Windows con Reaper

source: Jamulus user [Rob Durkin](https://sourceforge.net/u/bentwrench/profile/) has written a [guide to recording the output of Jamulus](https://docs.google.com/document/d/1tENfNKTWHasuTg33OdLLEo4-OOhWJolOo42ffSARxhY/edit) (Google Doc) using the ReaRoute add-on for [Reaper](https://www.reaper.fm/).
es: El usuario de Jamulus [Rob Durkin](https://sourceforge.net/u/bentwrench/profile/) ha escrito una [guía para grabar la salida de Jamulus](https://docs.google.com/document/d/1tENfNKTWHasuTg33OdLLEo4-OOhWJolOo42ffSARxhY/edit) (Google Doc, inglés) usando ReaRoute como add-on en [Reaper](https://www.reaper.fm/).

source: Sharing song/chord sheets
es: Compartir partituras

source: Jamulus user [BTDT](https://sourceforge.net/u/btdt/profile/) has written a system called [305keepers](https://github.com/keepers305/Song-Sheet-Sharing-Web-Pages), a web application that allows a "Jam leader" to push song sheets (in PDF format) to "Jammers" in real time using standard web browsers.
es: El usuario de Jamulus [BTDT](https://sourceforge.net/u/btdt/profile/) ha escrito un sistema llamado [305keepers](https://github.com/keepers305/Song-Sheet-Sharing-Web-Pages), una aplicación web que permite a un "Jam leader" repartir partituras (en formato PDF) entre "Jammers" en tiempo real utilizando navegadores de red estándares.

source: Jamulus Client Linux start script
es: Script de arranque para Cliente en Linux

source: Here's a Linux start script for Jamulus using an old Audigy4 sound card, the large number of available audio faders for which makes it hard to get the correct settings.
es: Aquí va un script the arranque para Jamulus utilizando una vieja tarjeta de audio Audigy4. El gran número de faders de audio disponibles hace que sea difícil establecer la configuración correcta.

source: This script therefore includes the most important audio fader settings. The second part of the script deals with the JACK connections. I use Guitarix as my guitar effect processor which I plug in in the JACK audio path.
es: Por tanto, este script incluye la configuración más importante para los faders de audio. La segunda parte del script se ocupa de las conexiones en Jack. Utilizo Guitarix como procesador de efectos de guitarra y lo inserto en la ruta del audio.

source: Finally I start Jamulus automatically connecting to the Directory.
es: Finalmente, arranco Jamulus automáticamente, conectándose al Directorio.

source: Here is the script:
es: Este es el script:

source: Using `--ctrlmidich` for MIDI controllers
es: Utilizar `--ctrlmidich` para controladores MIDI

source: The volume fader, pan control and mute and solo buttons in the Client's mixer window strips can be controlled using a connected MIDI controller. This feature is available from version 3.7.0 on macOS, Linux, and the JACK version of Jamulus for Windows. From Jamulus 3.12.0 onwards, it is also available for the non-JACK (ASIO) Windows version. To enable this feature, Jamulus must be launched with the `--ctrlmidich` command-line option.
es: El fader de volumen, el control de paneo y los botones de mute y solo en la ventana del mezclador del Cliente se pueden controlar utilizando un controlador MIDI conectado. Esta función está disponible desde la versión 3.7.0 en macOS, Linux, y la versión JACK de Jamulus para Windows. Desde Jamulus 3.12.0 en adelante, también está disponible para la versión sin JACK (ASIO) de Windows. Para habilitar esta función, Jamulus debe iniciarse con la opción `--ctrlmidich` en la línea de comandos.

source: When this option is used on the command line, Jamulus will prepend a channel number to each Client name, which can be used to control the channel using MIDI CC numbers. In Jamulus version 3.12.0 onwards, when connected to a server of at least version 3.5.5, your own fader will always be given channel 0, and so will appear first when sorted by channel or when "Own Fader First" is enabled.
es: Cuándo esta opción se utiliza en la línea de comandos, Jamulus asignará un número de canal prefijado a cada nombre de Cliente, el cual puede utilizarse para controlar el canal mediante números MIDI CC. Desde la versión de Jamulus 3.12.0 en adelante, cuando se está conectado a un servidor de al menos la versión 3.5.5, tu propio fader siempre recibirá el canal 0, así que aparecerá primero cuando se ordena por canal o cuando se habilita "Fader Propio Primero".

source: *Tip*: With default settings, when some users leave and others join, their left-right arrangement in the GUI may cease to follow a numerical order, making it more difficult to know who each physical fader/knob on your MIDI controller corresponds to. To keep the fader strips following a numerical order, go to "View" on the top menu bar and switch to "Sort by Channel" (or type `Ctrl+E`).
es: *Consejo*: Con la configuración predeterminada, cuando algunos usuarios se marchan y otros se conectan, su disposición de derecha-izquierda puede dejar de seguir un orden numérico, dificultando saber a quién corresponde cada pote/slider de tu controlador MIDI. Para que los faders sigan un orden numérico, despliega el menú de "Ver" en la barra superior y cambia a "Ordenar Usuarios por Canal" (o teclea `Ctrl+E`).

source: When using JACK or macOS, make sure you connect your MIDI device's output port to the Jamulus MIDI in port (QjackCtl (Linux/Windows), Audio/MIDI Setup (macOS) or whatever you use for managing connections). In Linux you may need to install and launch `a2jmidid` so your device shows up in the MIDI tab in Qjackctl. For non-JACK Windows, Jamulus will find the MIDI device(s) automatically, but see the `d` option below if more than one MIDI device is connected.
es: Cuando se utiliza JACK o macOS, asegúrate de que el puerto de salida de tu dispositivo MIDI esté conectado al puerto de entrada MIDI de Jamulus (QjackCtl (Linux/Windows), Audio/MIDI Setup (macOS) o lo que sea que utilices para gestionar las conexiones). En Linux quizá tengas que instalar y arrancar `a2jmidid` para que tu dispositivo aparezca en la pestaña MIDI de QjackCtl. En la versión para Windows sin JACK, Jamulus encontrará el/los dispositivo(s) MIDI automáticamente, pero consulta la opción `d` más abajo si hay más de un dispositivo MIDI conectado.

source: `--ctrlmidich` takes a single argument. If you omit it, the parameter is ignored. There are two formats for the argument:
es: `--ctrlmidich` acepta un único argumento. Si lo omites, el parámetro se ignora. Hay dos formatos para el argumento:

source: The legacy definition has one or two numbers in the format:
es: La definición heredada tiene uno o dos números en el formato:

source: [MIDI channel];[offset for first fader]
es: [Canal MIDI];[compensación para el primer fader]

source: `MIDI channel` is required or else the parameter argument is ignored and the feature is not active. `0` means "any channel", `1`-`16` listen only to MIDI messages on the specified MIDI channel.
es: Se requiere `canal MIDI`, de lo contrario el argumento del parámetro se ignora y la función no se activa. `0` significa "cualquier canal", `1`-`16` solo recibe mensajes MIDI en el canal MIDI especificado.

source: `offset for first fader` is the first MIDI CC to use to control a Jamulus Channel fader (default 70, which matches the Behringer X-Touch defaults), with all MIDI CCs after that being used; must be a number or else the long form is used.
es: `compensación para el primer fader` es el primer número MIDI CC utilizado para controlar un fader de Canal de Jamulus (por defecto 70, que encaja con el valor por defecto usado por el Behringer X-Touch), con todos los números MIDI CC consecutivo utilizados; debe ser un número, de lo contrario se utiliza el formato largo.

source: For example
es: Por ejemplo

source: would listen on all MIDI channels and use MIDI controller 70 to control Jamulus channel 0 fader and so on. Here's another example:
es: recibe en todos los canales MIDI y utiliza el controlador MIDI 70 para controlar el fader del canal 0 de Jamulus, y así sucesivamente. Aquí hay otro ejemplo:

source: This would listen on MIDI channel 2 and use MIDI controller 50 to control Jamulus channel 0 fader and so on.
es: Aquí recibe en el canal MIDI 2 y utiliza el controlador MIDI 50 para controlar el fader del canal 0 de Jamulus, y así sucesivamente.

source: The long form is a sequence of offsets and counts for various controllers:
es: El formato largo es una secuencia de compensaciones y cuentas para varios controladores:

source: [MIDI channel];[control letter][offset](*[count])(;...)
es: [canal MIDI];[letra de control][compensación](*[cuenta])(;...)

source: `control letter` defines which Jamulus Control the MIDI controller number is assigned to:
es: `letra de control` define a qué Control de Jamulus se asigna el número del controlador MIDI:

source: | control letter | Jamulus Control | |--------:|---------| | `f` | Fader | | `p` | Pan | | `s` | Solo | | `m` | Mute |
es: | letra de control | Control Jamulus | |--------:|---------| | `f` | Fader | | `p` | Paneo | | `s` | Solo | | `m` | Mute |

source: `offset` is the base MIDI CC number for the control.
es: `compensación` es el número MIDI CC de base para el control.

source: `count` is the number of CC values for the control, defaulting to 1 (i.e. the number Jamulus channels that can be controlled).
es: `cuenta` es el número de valores CC para el control, que por defecto es 1 (esto es, el número de canales de Jamulus que se pueden controlar).

source: An example for a Korg nanoKONTROL2 using eight sliders starting at MIDI CC 0 to control faders and eight knobs starting at MIDI CC 16 to control pan, on any MIDI channnel, for eight Jamulus channels would be
es: Un ejemplo para el Korg nanoKONTROL2 utilizando ocho potenciómetros deslizantes empezando en MIDI CC 0 para controlar faders y ocho potenciómetros giratorios empezando en MIDI CC 16 para controlar paneo, en cualquier canal MIDI, para ocho canales de Jamulus sería

source: Enhancing this to add eight Solo buttons starting at CC 32, and eight Mute buttons starting at CC 48 would give:
es: Aumentando esto para añadir ocho botones de Solo empezando en CC 32, y ocho botones de Mute empezando en CC 48 nos daría:

source: Two additional `control letter` values are available:
es: Hay disponibles dos valores de `letras de control` adicionales:

source: `o` controls Mute Myself and has a single `offset` (i.e. `count` is ignored and taken as 1).
es: `o` controla Silenciarme Yo y tiene una única compensación (esto es, se ignora `cuenta` y se toma como 1).

source: `d` is an option on Windows non-JACK Jamulus to specify a particular MIDI input device by name -- without this, all devices will be assigned to Jamulus; with it, only the specified device will be used. For example:
es: `d` es una opción en Jamulus para Windows sin JACK para especificar un dispositivo MIDI de entrada por nombre -- sin ello, todos los dispositivos serán asignados a Jamulus; con ello, solo se utilizará el dispositivo especificado. Por ejemplo:

source: would listen for CC0 through CC7 on MIDI channel 1 from a MIDI device called "nanoKontrol". Remember to wrap the whole of the `--ctrlmidich` argument in double quotes and you will have no problems with device names containing spaces.
es: recibiría desde CC0 hasta CC7 en el canal MIDI 1 desde un dispositivo MIDI llamado "nanoKontrol". Recuerda que debes meter el argumento `--ctrlmidich` en comillas dobles y así no tendrás problemas con nombres de dispositivos que contienen espacios.

source: In order to discover the correct device name to use, start Jamulus from the command line with `--ctrlmidich` and observe the output. Jamulus will list all discovered MIDI devices:
es: Para descubrir el nombre correcto del dispositivo a utilizar, arranca Jamulus desde la línea de comandos con `--ctrlmidich` y observa los mensajes. Jamulus dará una lista de todos los dispositivos descubiertos:

source: ``` C:\Users\Me>"C:\Program Files\Jamulus\Jamulus" --ctrlmidich "0" - MIDI controller settings: 0 - allocated port number: 22134 - MIDI devices found: 2 0: nanoKONTROL2 1: Keystation Mini 32
es: ``` C:\Users\Me>"C:\Program Files\Jamulus\Jamulus" --ctrlmidich "0" - configuración controlador MIDI: 0 - número de puerto asignado: 22134 - dispositivos MIDI encontrados: 2 0: nanoKONTROL2 1: Keystation Mini 32

source: C:\Users\Me>"C:\Program Files\Jamulus\Jamulus" --ctrlmidich "1;f0*8;p16*8;s32*8;m48*8;dnanoKONTROL2" - MIDI controller settings: 1;f0*8;p16*8;s32*8;m48*8;dnanoKONTROL2 - allocated port number: 22134 - MIDI devices found: 2 0: nanoKONTROL2 1: Keystation Mini 32 (ignored) ```
es: C:\Users\Me>"C:\Program Files\Jamulus\Jamulus" --ctrlmidich "1;f0*8;p16*8;s32*8;m48*8;dnanoKONTROL2" - configuración controlador MIDI: 1;f0*8;p16*8;s32*8;m48*8;dnanoKONTROL2 - número de puerto asignado: 22134 - dispositivos MIDI encontrados: 2 0: nanoKONTROL2 1: Keystation Mini 32 (ignorado) ```

source: Note that if only one MIDI device is connected, the `d` option is not necessary, as Jamulus will use the device automatically.
es: Nótese que si solo hay un dispositivo MIDI conectado, la opción `d` no es necesaria, ya que Jamulus utilizará este dispositivo automáticamente.

source: On macOS, Linux or Windows with JACK, the `d` option is accepted if given, but ignored.
es: En macOS, Linux o Windows con JACK, la opción `d` se acepta si se incluye, pero se ignora.

source: *Note*: Jamulus does not provide feedback on the on/off state of buttons, meaning that your controller must keep track and toggle LEDs (if any) to 'on' or 'off' itself, that is, buttons on your MIDI controller need to be set to "toggle" mode. This means that when pressed to 'turn on' a control, it must send a MIDI CC number with a value >=64, and to 'turn off' the control it must send the same CC number with a value <64. You can read your controller's manual to find out how to set this.
es: *Nota*: Jamulus no proporciona información al dispositivo sobre el estado de encendido/apagado de los botones, lo cual significa que tu controlador debe estar al tanto y conmutar los LEDs (si los tiene) entre 'encendido' y 'apagado' por sí mismo; esto es, los botones de tu controlador MIDI deben estar en modo conmutador ("toggle"). Esto significa que cuando se pulsa para "encender" un control, debe enviar un número MIDI CC con un valor >=64, y para "apagar" el control debe enviar el mismo número CC con un valor <64. Puedes leer el manual de tu controlador para ver cómo configurar esto.

source: For Server admins
es: Para administradores de Servidores

source: Converting a Registered Server to an Unregistered one on the fly
es: Convertir un Servidor Registrado en uno Sin Registrar sobre la marcha

source: You can run as a Registered Server long enough for people to connect, then go "private" (Unregistered) by setting the Directory to "none" in the Server GUI. Musicians will still be connected to the Server until they disconnect. (Thanks to [David Savinkoff](https://github.com/DavidSavinkoff) for this tip!)
es: Puedes ejecutar un Servidor Registrado el tiempo suficiente para que la gente se conecte, y luego hacerlo "privado" (Sin Registrar) cambiando el Directorio a "ninguno" en la ventana del Servidor. La gente seguirá conectada al Servidor hasta que se desconecte. (¡Gracias a [David Savinkoff](https://github.com/DavidSavinkoff) por este truco!)

source: Remote management of recordings
es: Gestión remota de grabaciones

source: Jamulus user [vdellamea](https://github.com/vdellamea) has written a [web-based remote tool](https://github.com/vdellamea/jamulus-server-remote) for starting and stopping recordings on Linux Servers, allowing you to then download them from your browser. See also [Jamulus Jam Exporter](https://github.com/pljones/jamulus-jamexporter) by [pljones](https://github.com/pljones), which also includes a Server recording recovery script.
es: El usuario de Jamulus [vdellamea](https://github.com/vdellamea) ha escrito una [herramienta web remota](https://github.com/vdellamea/jamulus-server-remote) para iniciar y detener grabaciones en Servidores en Linux, permitiéndote descargarlas luego desde tu navegador. Ver también [Jamulus Jam Exporter](https://github.com/pljones/jamulus-jamexporter) de [pljones](https://github.com/pljones), que también incluye un script de recuperación de grabaciones del Servidor.

source: Making a Server status page
es: Hacer una página de estado del Servidor

source: With the `-m` command line argument, Server statistics can be generated to be put on a web page.
es: Con el parámetro `-m` de la línea de comandos, se pueden generar estadísticas del Servidor para mostrarlas en una página web.

source: Here is an example php script using the Server status file to display the current Server status on a html page (assuming the following command line argument to be used: `-m /var/www/stat1.dat`):
es: Este es un ejemplo de script php utilizando el archivo de estado del Servidor para mostrar el estado actual del Servidor en una página html (asumiendo que se utiliza el siguiente parámetro de la línea de comandos: `-m /var/www/stat1.dat`):
